#%%
import os
import openai
from pydantic import BaseSettings, Field

class ChatGPTNewsSettings(BaseSettings):

    api_key: str = Field(..., env='OPENAI_API_KEY')

    class Config:
        env_file = '.env'
        env_file_encoding = 'utf-8'


class ChatGPTNews:

    MODEL="gpt-3.5-turbo"
    api_key=None

    def __init__(self, settings: ChatGPTNewsSettings):
        self.api_key = settings.api_key

    def one_off_response(self, ask: str):
        
        openai.api_key = self.api_key
        completion = openai.ChatCompletion.create(
            model=self.MODEL,
            messages=[
                {"role": "user", "content": f"{ask}"}
            ]
        )

        return(completion.choices[0].message["content"])


#%%
if __name__ == "__main__":

    settings = ChatGPTNewsSettings()
    my_response = ChatGPTNews(settings)

    text="""
    Based on these records, give me a news update. Please deliver the response in simplied Chinese:
    ['摄徐州市中级人民法院认为被告人董志民虐待家庭成员情节恶劣构成虐待罪且致小花梅患精神分裂症不可逆转具有致被害人重伤的加重情节构成非法拘禁罪依法应数罪并罚被告人时立忠桑合妞谭爱庆霍永渠霍福得拐卖妇女造成严重后果构成拐卖妇女罪1998年参与拐卖小花梅犯罪嫌疑人共有7人其拐卖行为均已超过追诉期为从严打击拐卖妇女犯罪经最高人民检察院核准徐州市人民检察院对在拐卖妇女犯罪中作用较大情节严重的时立忠桑合妞谭爱
    ['丰县生育八孩女子事件相关案件一审公开宣判', '今天江苏省徐州市中级人民法院一审公开宣判被告人董志民虐待非法拘禁案被告人时立忠桑合妞拐卖妇女案和被告人谭爱庆霍永渠霍福得拐卖妇女案法院判决被告人董志民犯虐待罪判处有期徒刑六年六个月犯非法拘禁罪判处有期徒刑三年数罪并罚决定执行有期徒刑九年判决被告人时立忠桑合妞谭爱庆霍永渠霍福得犯拐卖妇女罪分别判处有期徒刑十一年十年十三年八年六个月和八年并处罚金总台
    ['丰县生育八孩女子事件相关案件一审及后续情况六问新华网', '新华社南京4月7日电', '题丰县生育八孩女子事件相关案件一审及后续情况六问新华社新华视点记者段羡菊刘江朱国亮4月7日丰县生育八孩女子事件相关案件在徐州市中级人民法院一审宣判虐待非法拘禁小花梅的董志民和拐卖小花梅的时立忠桑合妞谭爱庆霍永渠霍福得等人受到法律惩处新华视点记者围绕案件指控量刑以及小花梅现状等公众关心的几个焦点问题采访了公诉
    ['sina', 'system', 'visitor']
    ['今天丰县八孩案一审宣判相关法律依据是什么本案发生在徐州丰县为何直接由中级人民法院审理1998年参与拐卖小花梅的嫌疑人共有7人均超过20年的法定追诉期追诉的程序和条件是什么看央视总台独家视频来源央视新闻', '丰县生育八孩女子事件一审宣判庭审画面曝光']
    ['朱国亮7日江苏省徐州市中级人民法院对丰县生育八孩女子事件相关案件一审宣判认定董志民犯虐待罪判处有期徒刑六年六个月犯非法拘禁罪判处有期徒刑三年数罪并罚决定执行有期徒刑九年认定被告人时立忠桑合妞谭爱庆霍永渠霍福得犯拐卖妇女罪分别判处有期徒刑十一年十年十三年八年六个月和八年并处罚金庭审中被告人董志民时立忠桑合妞霍永渠霍福得表示认罪悔罪2022年1月27日丰县生育八孩女子视频在网络流传引发社会关注经公
    ['sina', 'system', 'visitor']
    ['中国法院星期四4月6日一审宣判以虐待罪和非法拘禁罪判处江苏丰县生育八孩女子案件其中一名被告即女子的丈夫董志民有期徒刑九年另外五名被告因拐卖妇女罪分别被判有期徒刑八年至13年外加罚款徐州市中级人民法院星期五7日在微信公众号上通报1998年初被告人时立忠桑合妞以治病等为名将受害人小花梅从云南省福贡县子里甲乡亚谷村拐骗至江苏省东海县后二人将小花梅以人民币5000元967新元卖给该县农民徐某东涉嫌犯收
    ['丰县八孩案', '大公报讯据新华社报道7日江苏省徐州市中级人民法院对丰县生育八孩女子事件相关案件一审宣判认定董志民犯虐待罪判处有期徒刑六年六个月犯非法拘禁罪判处有期徒刑三年数罪并罚决定执行有期徒刑九年认定被告人时立忠桑合妞谭爱庆霍永渠霍福得犯拐卖妇女罪分别判处有期徒刑十一年十年十三年八年六个月和八年并处罚金庭审中被告人董志民时立忠桑合妞霍永渠霍福得表示认罪悔罪2022年1月丰县生育八孩女子视频
    ['记者白光迪7日江苏省徐州市中级人民法院对丰县生育八孩女子事件相关案件一审宣判认定董志民犯虐待罪判处有期徒刑六年六个月犯非法拘禁罪判处有期徒刑三年数罪并罚决定执行有期徒刑九年认定被告人时立忠桑合妞谭爱庆霍永渠霍福得犯拐卖妇女罪分别判处有期徒刑十一年十年十三年八年六个月和八年并处罚金庭审中被告人董志民时立忠桑合妞霍永渠霍福得表示认罪悔罪2022年1月27日丰县生育八孩女子视频在网络流传引发社会关注
    """
    answer = my_response.one_off_response(text)
# %%
